{
  "basics": {
    "name": "Leonard Niehaus",
    "image": "",
    "email": "niehaus.1301@gmail.com",
    "phone": "+491722458460",
    "url": "https://niehaus.io",
    "summary": "To me, software development is a way to live out my creativity, as you can realize near limitless ideas with often minimal resources. I always give software its own branding and identity, as it allows others and myself to better relate to it. Whenever something piques my interest, I quickly find ways to get as much new input as possible. A notable example is that I developed a passion for aviation during my travels with CGI and transitioned my career to working in aviation.",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "leonard-niehaus",
        "url": "https://linkedin.com/in/leonard-niehaus"
      }
    ]
  },
  "work": [
    {
      "name": "Airbus Commercial",
      "position": "Full-Stack developer for Flight Physics",
      "url": "https://airbus.com",
      "startDate": "2023-06-01",
      "endDate": null,
      "location": "Hamburg, Germany",
      "highlights": [
        "Built a Next.js 13 app to automatically generate DSM matrices based on tools used in the flight physics department to showcase their dependencies, with features including a drag-and-drop JSON schema editor and OpenAPI export.",
        "Developing a modern Web API for a PostgreSQL database storing raw flight test time-series data in Python and Flask, as part of a large SAFe project with joint teams across Hamburg, Toulouse, UK and India. The API supports CRUD operations and endpoints for specific use cases."
      ],
      "companyLogoUrl": "airbusLogo.jpeg"
    },
    {
      "name": "CGI",
      "position": "Senior Consultant",
      "url": "https://cgi.com",
      "startDate": "2019-11-01",
      "endDate": "2023-05-31",
      "location": "Dusseldorf, Germany",
      "highlights": [
        "Founded, developed and launched CGI’s internal startup Door James, a visitor registration SaaS solution to replace paper lists at reception (later transitioned to asset booking and office management solution due to COVID demands).",
        "Developed and deployed a multi-cloud architecture for Door James (GCP & IONOS) to attract clients needing sovereign cloud options. Dockerized application to allow easier deployment to cloud providers. Moved from Google Cloud Build to GitLab CI/CD.",
        "Traveled to multiple international clients to pitch Door James and launch trials (20+ external clients when left role).",
        "Designed concept and coordinated development to extend Door James by an event management and ticketing platform. Flawlessly managed ticketing, registration and badge-printing at multiple in-person events with 500+ attendees each.",
        "Created a Google Data Studio connector using Google Apps Script and MongoDB Atlas Data API to allow a BI team to build dashboards with Door James userdata.",
        "Held talks externally and internally to share key learnings of Door James product development journey, with a strong focus on how to maintain a great balance.",
        "Organized events on Meetup.com to increase CGIs presence in the local tech scene.",
        "Pitched Door James in multiple c-level calls, and worked extensively with the CIO office to have Door James become CGIs global asset booking solution (now rolled out in 100+ offices with 35k users).",
        "Actively contributed to backend code (Node.js, TypeScript, Mongoose, Express), infrastructure on GCP (App Engine, Cloud Functions, Compute Engine, Load Balancer, Cloud Storage), architecture and concepts for Door James.",
        "Developed a retail customer journey for CGIs booth at Euroshop 2020. Connected dynamic e-ink price tags to programmatically adjust prices based on customers' food preference. Implemented a stock picking demo-case with Firebase Firestore and Hosting."
      ],
      "companyLogoUrl": "cgiLogo.jpeg"
    },
    {
      "name": "Ampool",
      "position": "Cloud Engineer Intern",
      "url": "https://ampool.com",
      "startDate": "2019-08-01",
      "endDate": "2019-10-31",
      "location": "Mountain View, California",
      "highlights": [
        "Ensured compatibility of Ampool’s data analytics software with GCP.",
        "Demonstrated functionality by creating multiple environments that involve large datasets on BigQuery and Microsoft SQL Server to be analyzed."
      ],
      "companyLogoUrl": "ampoolLogo.jpeg"
    },
    {
      "name": "Cititec Systems",
      "position": "Intern",
      "url": "https://cititec.com.au",
      "startDate": "2018-06-01",
      "endDate": "2018-07-31",
      "location": "Melbourne, Australia",
      "highlights": [
        "Planned, designed and launched a new company website on WordPress.",
        "Worked on a ticket system based on PHP & MySQL."
      ],
      "companyLogoUrl": "cititecLogo.jpeg"
    }
  ],
  "education": [
    {
      "institution": "College for Technology and IT",
      "url": "https://www.bti-neuss.de/?lang=en",
      "area": "IT",
      "studyType": "High School",
      "startDate": "2017-09-01",
      "endDate": "2020-03-31",
      "highlights": [
        "Earned an excellent high school diploma and completed professional training to become a recognized IT assistant.",
        "This includes advanced knowledge in IT subjects such as Networking, Programming & Databases."
      ]
    }
  ],
  "certificates": [
    {
      "name": "Google Cloud Associate Cloud Engineer",
      "date": "2021-01-01",
      "issuer": "Google",
      "url": "https://cloud.google.com/certification/cloud-engineer/"
    },
    {
      "name": "Plesk Onyx Professional",
      "date": "2018-10-01",
      "issuer": "Plesk University",
      "url": "https://plesk.com/onyx/professional-certification/"
    }
  ],
  "skills": [
    {
      "name": "Web Development"
    },
    {
      "name": "Terraform"
    }
  ],
  "languages": [
    {
      "language": "German",
      "fluency": "Native"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "projects": [
    {
      "name": "Autaxo",
      "type": "startup",
      "summary": "Supercharged car dealership management with tax optimizations",
      "startDate": "2023-11-01",
      "endDate": "2021-01-01",
      "description": "Description...",
      "highlights": ["Won award at AIHacks 2016"],
      "url": "https://www.autaxo.de/",
      "images": ["autaxo-screenshot.png"]
    },
    {
      "name": "3D Room",
      "type": "personal",
      "summary": "An interactive 3D model of a room representing my personality",
      "startDate": "2023-11-01",
      "endDate": "2021-01-01",
      "description": "Description...",
      "highlights": ["Won award at AIHacks 2016"],
      "url": "/room",
      "images": ["room-screenshot.png"]
    },
    {
      "name": "InvoEQ",
      "type": "personal",
      "summary": "A simple image to table parser based on optical character recognition",
      "startDate": "2023-09-01",
      "endDate": "2021-01-01",
      "description": "Description...",
      "highlights": ["Won award at AIHacks 2016"],
      "url": "https://invoeq.com",
      "images": ["invoeq-screenshot.png"]
    },
    {
      "name": "Blocky.Host",
      "type": "personal",
      "summary": "Free gameservers on Google Cloud Compute Engine Spot machines",
      "startDate": "2019-01-01",
      "endDate": "2021-01-01",
      "description": "Description...",
      "highlights": ["Won award at AIHacks 2016"],
      "url": "https://github.com/niehaus1301?tab=repositories&q=blockyhost",
      "images": ["blockyhost-screenshot.png"]
    },
    {
      "name": "Door James",
      "type": "work",
      "summary": "Free gameservers on Google Cloud Compute Engine Spot machines",
      "startDate": "2020-01-01",
      "endDate": "2023-04-01",
      "description": "The world of work is changing dramatically, with flexible work arrangements and remote work now commonplace. Effectively managing office workspaces has become a greater priority and challenge for organizations across industries in today’s hybrid work environments. Door James enables the smart management of your workspaces, providing you with a complete view of workspace occupancy and facilitating fast and secure bookings.",
      "highlights": ["Won award at AIHacks 2016"],
      "url": "https://www.cgi.com/en/solutions/intelligence-automation/door-james",
      "images": [
        "doorjames-screenshot.png",
        "doorjames-screenshot1.png",
        "doorjames-screenshot2.png",
        "doorjames-screenshot3.png"
      ],
      "work": "CGI"
    },
    {
      "name": "FLUSI",
      "type": "personal",
      "summary": "Home-built flight simulator with a YouTube channel for progress updates",
      "startDate": "2019-01-01",
      "endDate": "2021-01-01",
      "description": "Description...",
      "highlights": ["Won award at AIHacks 2016"],
      "url": "https://www.youtube.com/@flusi8105",
      "images": ["flusi-screenshot.jpg"]
    }
  ],
  "funfacts": [
    "I wear multiple NFC-microchip implants in my hands, including a credit card",
    "I've traveled to 70 countries. Mostly by staying up to date with flight plans of budget airlines, and then combining low-cost routes on seperate tickets to reach many destinations for a fraction of the cost of a regular ticket.",
    "When I was a kid, I've built a flight simulator in my basement. As the cockpit didn't follow any existing aircraft due to budget constraints, I've decideded to call it the Airbus A370 :P (this aircraft doesn't exist)."
  ]
}
